Проблема C: Стандартная задача о футболе
Какёин любит футбол и выходит в финал чемпионата мира. На стадионе он обратил внимание, что есть 
 ряды, каждый из которых может вместить определенное количество людей. Цена билета зависит от ряда. Если есть 
 (
 > 0) свободных мест в ряду, то цена одного билета будет равна k. Какую максимальную сумму денег может получить руководство стадиона, если есть 
 Люди в очереди за билетом?

Формат ввода
Первая линия состоит из 
 и 
 (
). 
 обозначает количество рядов сидячих мест на стадионе и 
 обозначает количество футбольных болельщиков, ожидающих в очереди за билетом на матч.

Следующая строка состоит из 
 целые числа через пробел 
, 
, 
, ..., 
 где 
 (
) обозначает количество свободных мест изначально в поле 
-й ряд.

Гарантируется, что свободных мест хватит для всех посетителей.

Формат вывода
Выведите одно целое число - максимальную сумму денег, которую может заработать стадион.


#include <iostream>
using namespace std;

const int N = 100005;
long long a[N];

void quickSort(long long arr[], int l, int r) {
    int i = l, j = r;
    long long pivot = arr[(l + r) / 2];
    while (i <= j) {
        while (arr[i] > pivot) i++;
        while (arr[j] < pivot) j--;
        if (i <= j) {
            long long tmp = arr[i];
            arr[i] = arr[j];
            arr[j] = tmp;
            i++; j--;
        }
    }
    if (l < j) quickSort(arr, l, j);
    if (i < r) quickSort(arr, i, r);
}

int main() {
    int n, m;
    cin >> n >> m;
    for (int i = 0; i < n; i++) cin >> a[i];

    quickSort(a, 0, n - 1); 

    long long total = 0;

    for (int k = 0; k < m; k++) {
        total += a[0];
        a[0]--;

        int i = 0;
        while (i + 1 < n && a[i] < a[i + 1]) {
            long long tmp = a[i];
            a[i] = a[i + 1];
            a[i + 1] = tmp;
            i++;
        }
    }

    cout << total << endl;
    return 0;
}
