Проблема C: Стандартная задача о футболе
Какёин любит футбол и выходит в финал чемпионата мира. На стадионе он обратил внимание, что есть 
 ряды, каждый из которых может вместить определенное количество людей. Цена билета зависит от ряда. Если есть 
 (
 > 0) свободных мест в ряду, то цена одного билета будет равна k. Какую максимальную сумму денег может получить руководство стадиона, если есть 
 Люди в очереди за билетом?

Формат ввода
Первая линия состоит из 
 и 
 (
). 
 обозначает количество рядов сидячих мест на стадионе и 
 обозначает количество футбольных болельщиков, ожидающих в очереди за билетом на матч.

Следующая строка состоит из 
 целые числа через пробел 
, 
, 
, ..., 
 где 
 (
) обозначает количество свободных мест изначально в поле 
-й ряд.

Гарантируется, что свободных мест хватит для всех посетителей.

Формат вывода
Выведите одно целое число - максимальную сумму денег, которую может заработать стадион.


