Проблема D: Экспериментируйте со смесями
Марк проводит эксперимент со смесями разной плотности. Для своего эксперимента он хочет, чтобы все смеси имели плотность 
.

Для получения комбинированной смеси он использует следующую формулу: 
 = 
 +  
где 
 – плотность новой смеси, 
 является наименьшей плотностью среди всех смесей и  
 является второй наименьшей плотностью среди всех смесей.

Марк повторяет смешивание до тех пор, пока не получит все смеси с плотностью 
.

Вам даны плотности смесей. Сколько раз Марк должен смешивать свои смеси, чтобы получить плотности всех смесей 
?

Формат ввода
Первая строка состоит из целых чисел 
 и 
 (
, 
), количество смесей и минимально необходимую плотность соответственно.

Следующая строка содержит 
 целые числа через пробел 
 (
), описывающие плотности смесей.

Формат вывода
Выведите количество операций, необходимых для создания всех плотностей 
. Если это невозможно, распечатайте 
.
