Задача E: K-я сумма
Нурдана обожает печенье! Она хранит все печенье в отдельных коробках, но мама разрешает ей хранить только 
 Коробки. Ее папа является помощником в этом деле. Он дарит ей коробку, в которой есть 
 Печенье. Помогите ей посчитать, сколько печенья она может съесть?

Формат ввода
В первой строке записаны два целых числа 
 и 
 (1 
 
, 
 
 
). Каждый из следующих 
 lines содержит одну команду.

Существует два типа команд:

вставка 
 - папа дарит коробку с 
 Файлы cookie (
)

print - распечатать максимальное количество печенья, которое может иметь Нурдана

Формат вывода
Для каждого запроса типа print вывести максимальное количество файлов cookie, если считать не более 
 Коробки.
